{
  "backend/main.mo": "Defines video, user, comment, reaction, and post types with maps for storage, plus access-controlled methods for registering posts, liking them, and retrieving profiles and post data.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to related files, components, and test IDs for preloader and routing behavior changes.",
  "frontend-file-summaries.txt": "Provides short summaries of many frontend files describing their roles in layout, navigation, pages, video feed, creation tools, and hooks.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and applying base styles for background, text, and borders.",
  "frontend/index.html": "Basic HTML entry file mounting the app root and loading the main React script.",
  "frontend/src/App.tsx": "Main React app entry configuring TanStack Router, app routes, theme provider, and always showing the animated preloader on fresh load.",
  "frontend/src/components/auth/AuthButton.tsx": "Authentication button handling Internet Identity login/logout with loading states and query cache clearing.",
  "frontend/src/components/auth/AuthGate.tsx": "Wrapper that blocks access when unauthenticated and shows a login prompt or fallback component.",
  "frontend/src/components/create/CameraRecorder.tsx": "Camera recording component using MediaRecorder and useCamera hook to capture video or fall back to upload on errors.",
  "frontend/src/components/create/CaptureOrUploadStep.tsx": "Handles capturing video/photo, recording, text-to-image generation, or file uploads before passing a File to the next step.",
  "frontend/src/components/create/CreationFlow.tsx": "Manages the multi-step creation flow including mode selection, capture, editing, and preview stages.",
  "frontend/src/components/create/editor/DuetComposer.tsx": "Renders a side-by-side duet of the source video and the user's video.",
  "frontend/src/components/create/editor/EditorStage.tsx": "Displays the media during editing with support for playback control, captions, stickers, and basic interactions.",
  "frontend/src/components/create/editor/tools/AutoCutTool.tsx": "Generates automatic cut segments based on a sensitivity threshold and updates editor state with resulting segments.",
  "frontend/src/components/create/editor/tools/CaptionsTool.tsx": "Provides UI to add, remove, and adjust captions including text and size adjustments.",
  "frontend/src/components/create/editor/tools/EffectsTool.tsx": "Lets users apply or toggle visual effects, replacing the current effect list with the selected effect.",
  "frontend/src/components/create/editor/tools/FiltersTool.tsx": "Allows selecting a single visual filter by toggling between predefined filter options.",
  "frontend/src/components/create/editor/tools/GreenScreenTool.tsx": "Enables uploading, previewing, and clearing a background image for green screen replacement.",
  "frontend/src/components/create/editor/tools/SoundLabTool.tsx": "Manages music selection, uploads, and volume controls for original and added audio tracks.",
  "frontend/src/components/create/editor/tools/SpeedTool.tsx": "Presents predefined playback speeds and updates the editor state when one is selected.",
  "frontend/src/components/create/editor/tools/StickersTool.tsx": "Supports adding preset stickers to the canvas and removing previously added stickers.",
  "frontend/src/components/create/editor/tools/TrimTool.tsx": "Provides a slider to adjust trim start and end positions and updates the editor state accordingly.",
  "frontend/src/components/create/editor/tools/VoiceoverTool.tsx": "Provides UI and logic for recording, clearing, and applying effects to a voiceover in the editor.",
  "frontend/src/components/create/editor/ToolsPanel.tsx": "Main tool selector panel that displays available editing tools and renders the active tool’s UI based on user selection.",
  "frontend/src/components/create/EditorStep.tsx": "Loads media, manages editor state, and triggers video rendering before moving to the preview step.",
  "frontend/src/components/create/ModeSelect.tsx": "Displays mode selection buttons for creating video, photo, or text content.",
  "frontend/src/components/create/PreviewStep.tsx": "Shows a preview of the rendered output and handles title input and publishing the video.",
  "frontend/src/components/create/UploadFallback.tsx": "Provides a drag-and-drop or manual file picker UI for uploading video files.",
  "frontend/src/components/create/VideoPreview.tsx": "Simple component for loading and displaying a video preview with controls.",
  "frontend/src/components/feed/VerticalVideoFeed.tsx": "Renders a vertically scrolling video feed and tracks which video is active using IntersectionObserver.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main app layout with header, content area, footer, and bottom tab navigation.",
  "frontend/src/components/navigation/BottomTabs.tsx": "Renders bottom navigation tabs and highlights the active route using TanStack Router.",
  "frontend/src/components/preloader/FirstLaunchPreloader.tsx": "Displays a timed animated ZIZO logo sequence on first launch before fading out.",
  "frontend/src/components/profile/EditProfileModal.tsx": "Modal for profile editing placeholder, currently showing disabled profile picture upload.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Shows a required onboarding modal for new authenticated users to set their display name.",
  "frontend/src/components/video/CommentsModal.tsx": "Dialog that displays video comments, allows posting new comments, and handles auth validation.",
  "frontend/src/components/video/InteractionBar.tsx": "Provides interactive buttons for liking, commenting, reacting, following, sharing, and dueting on a video.",
  "frontend/src/components/video/ShareModal.tsx": "Modal for sharing videos via Web Share API or copying a generated share link.",
  "frontend/src/components/video/VideoCard.tsx": "Displays a video with play/pause behavior, double‑tap liking, and an interaction bar.",
  "frontend/src/components/video/VideoPoster.tsx": "Shows a placeholder image and loading overlay while a video is loading.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useDoubleTap.ts": "Detects double‑tap gestures using timing between taps.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login/logout handling, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "React-query hooks for videos, trending, likes, uploads, profiles, comments, and reactions.",
  "frontend/src/hooks/useTapGestures.ts": "Handles single‑tap and double‑tap gestures with timers and callbacks.",
  "frontend/src/index.css": "Tailwind base styles plus custom theme variables, layout utilities, and preloader styling.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and Internet Identity provider.",
  "frontend/src/pages/AndroidIiLoginPage.tsx": "Android-specific login page handling Internet Identity auth, redirecting to the app and showing success or error states.",
  "frontend/src/pages/CreatePage.tsx": "Create page requiring authentication and launching the video creation flow with optional duet support.",
  "frontend/src/pages/HomePage.tsx": "Home feed page that loads and displays videos or shows loading/error/empty states.",
  "frontend/src/pages/NotificationsPage.tsx": "Static notifications page showing an empty state with a header.",
  "frontend/src/pages/ProfilePage.tsx": "Profile page showing user info, follower counts, and video list with edit profile support.",
  "frontend/src/pages/TrendingPage.tsx": "Trending videos page fetching and displaying ranked trending video cards.",
  "frontend/src/utils/editor/audioAnalysis.ts": "Analyzes audio by sampling amplitude windows and returning an array of volume values.",
  "frontend/src/utils/editor/audioMixing.ts": "Combines original video audio with music and voiceover using Web Audio API, applying effects when needed.",
  "frontend/src/utils/editor/renderPipeline.ts": "Renders edited video frames with filters, effects, captions, stickers, and mixes audio before exporting.",
  "frontend/src/utils/editor/types.ts": "Defines TypeScript types for editor state including filters, effects, captions, stickers, and audio settings.",
  "frontend/src/utils/editor/videoProcessing.ts": "Provides functions to apply pixel-level video filters and canvas-based visual effects to frames using CanvasRenderingContext2D.",
  "frontend/src/utils/editor/voiceEffects.ts": "Applies pitch and filter-based voice effects by rendering audio through an OfflineAudioContext.",
  "frontend/src/utils/haptics.ts": "Triggers simple vibration patterns based on light, medium, or heavy intensity.",
  "frontend/src/utils/share.ts": "Generates shareable video URLs and handles sharing via Web Share API or clipboard fallback.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, animations, typography, and container settings with theme variables.",
  "project_state.json": "Tracks project metadata, features, and requirements for the ZIZO app, including preloader behavior notes."
}