{
  "backend/main.mo": "Motoko backend with access-controlled user profiles, video storage, likes, comments, reactions, and follow relationships.",
  "feature_evidence.json": "Feature evidence report mapping navigation bar layout fixes to affected files and components with confidence flags.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files describing their roles in layout, navigation, auth, video feed, and creation workflow.",
  "frontend/index.css": "Tailwind base/theme CSS defining color tokens, dark mode variables, and global styling.",
  "frontend/index.html": "HTML entry point mounting the root element and loading the main TypeScript module.",
  "frontend/src/App.tsx": "App entry configuring TanStack Router routes with AppShell, pages, theme provider, and toaster.",
  "frontend/src/components/auth/AuthButton.tsx": "Authentication button handling Internet Identity login/logout with loading states and cache clearing.",
  "frontend/src/components/auth/AuthGate.tsx": "Gate component that blocks access when unauthenticated and shows a login prompt or fallback.",
  "frontend/src/components/create/CameraRecorder.tsx": "Camera recorder using MediaRecorder and custom camera hook to capture video or fall back to upload.",
  "frontend/src/components/create/CaptureOrUploadStep.tsx": "Handles capturing video, photos, text-to-image rendering, or uploading files and passes the resulting File to the next step.",
  "frontend/src/components/create/CreationFlow.tsx": "Manages the multi-step creation workflow including mode selection, capture, editing, and preview.",
  "frontend/src/components/create/editor/DuetComposer.tsx": "Displays a duet layout with the source video and user's video side-by-side.",
  "frontend/src/components/create/editor/EditorStage.tsx": "Renders the media preview with applied editor state including speed, captions, and stickers.",
  "frontend/src/components/create/editor/tools/AutoCutTool.tsx": "Generates auto-cut segments based on duration and sensitivity threshold. Updates editor state with generated segment list.",
  "frontend/src/components/create/editor/tools/CaptionsTool.tsx": "Adds, removes, and edits caption text and size within the editor state. Provides UI for managing multiple caption entries.",
  "frontend/src/components/create/editor/tools/EffectsTool.tsx": "Allows selecting a single visual effect and updates the editor’s effects array. Uses buttons to toggle the active effect.",
  "frontend/src/components/create/editor/tools/FiltersTool.tsx": "Provides filter selection with a single active filter at a time. Updates the editor’s filters array accordingly.",
  "frontend/src/components/create/editor/tools/GreenScreenTool.tsx": "Handles upload and removal of a background image for green screen replacement. Updates editor state with background URL and settings.",
  "frontend/src/components/create/editor/tools/SoundLabTool.tsx": "Manages music selection, upload, and audio volume mixing for original and added tracks. Updates editor state with music settings.",
  "frontend/src/components/create/editor/tools/SpeedTool.tsx": "Lets users pick a playback speed and updates the editor’s speed value. Displays preset speed options.",
  "frontend/src/components/create/editor/tools/StickersTool.tsx": "Enables adding stickers from packs and removing existing ones. Updates editor state with sticker objects and their properties.",
  "frontend/src/components/create/editor/tools/TrimTool.tsx": "Provides trim-range sliders to set start and end times. Updates editor trim values based on slider input.",
  "frontend/src/components/create/editor/tools/VoiceoverTool.tsx": "Allows recording, clearing, and applying effects to a voiceover, updating editor state accordingly.",
  "frontend/src/components/create/editor/ToolsPanel.tsx": "Main tool panel that displays available editing tools and renders the active tool’s UI. Filters tools based on mode and manages tool selection state.",
  "frontend/src/components/create/EditorStep.tsx": "Provides the editing interface, manages editor state, and renders the final media before preview.",
  "frontend/src/components/create/ModeSelect.tsx": "UI for selecting creation mode: video, photo, or text.",
  "frontend/src/components/create/PreviewStep.tsx": "Shows a preview of the rendered output and handles publishing with title and caption input.",
  "frontend/src/components/create/UploadFallback.tsx": "Drag-and-drop or click-to-upload component for selecting a video file.",
  "frontend/src/components/create/VideoPreview.tsx": "Simple video preview component that reloads when the source URL changes.",
  "frontend/src/components/feed/VerticalVideoFeed.tsx": "Renders a vertically scrollable video feed and tracks which video is active using an IntersectionObserver.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main app layout with header, tab bar, footer, and content container.",
  "frontend/src/components/navigation/BottomTabs.tsx": "Displays a fixed bottom navigation bar with tab buttons that navigate between routes.",
  "frontend/src/components/profile/EditProfileModal.tsx": "Shows a modal for profile editing with placeholder UI for future customization features.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Prompts new authenticated users to enter a display name and saves it via API.",
  "frontend/src/components/video/CommentsModal.tsx": "Modal for viewing and posting comments on a video, showing comment list and input form.",
  "frontend/src/components/video/InteractionBar.tsx": "Provides like, comment, react, follow, share, and duet actions for a video with related modals.",
  "frontend/src/components/video/ShareModal.tsx": "Modal for sharing a video, supporting Web Share and clipboard copy with toast feedback.",
  "frontend/src/components/video/VideoCard.tsx": "Displays a video with autoplay, double‑tap like interaction, and optional interaction bar.",
  "frontend/src/components/video/VideoPoster.tsx": "Shows a placeholder poster and loading state while a video loads.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useDoubleTap.ts": "Provides a handler to detect double‑tap gestures within a configurable delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, loading identities, login flow, and related state management.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for videos, profiles, comments, reactions, and uploads using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, dark mode, and layout utilities.",
  "frontend/src/main.tsx": "App entry point configuring React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/CreatePage.tsx": "Create page gating access by authentication and launching the video creation flow with optional duet support.",
  "frontend/src/pages/HomePage.tsx": "Home feed page fetching and displaying videos with loading, error, and empty states.",
  "frontend/src/pages/NotificationsPage.tsx": "Static notifications page showing a placeholder UI and including the profile setup modal.",
  "frontend/src/pages/ProfilePage.tsx": "Displays the authenticated user's profile, follower stats, and video list with edit modals and loading states.",
  "frontend/src/pages/TrendingPage.tsx": "Fetches and shows trending videos with ranking badges, plus loading and error handling.",
  "frontend/src/utils/editor/audioAnalysis.ts": "Analyzes audio by sampling amplitude over time and returns an array of volume values.",
  "frontend/src/utils/editor/audioMixing.ts": "Combines video audio with music and voiceover tracks, applying volume and effects using OfflineAudioContext.",
  "frontend/src/utils/editor/renderPipeline.ts": "Renders edited video frames to a canvas, applies filters/effects, mixes audio, and outputs a final webm file.",
  "frontend/src/utils/editor/types.ts": "Defines TypeScript types for editor filters, effects, captions, stickers, audio settings, and overall editor state.",
  "frontend/src/utils/editor/videoProcessing.ts": "Applies pixel-level filters and visual effects to video frames on a canvas.",
  "frontend/src/utils/editor/voiceEffects.ts": "Applies chipmunk, deep, or robotic voice effects to an AudioBuffer via OfflineAudioContext.",
  "frontend/src/utils/haptics.ts": "Triggers vibration feedback with configurable intensity.",
  "frontend/src/utils/share.ts": "Generates share URLs and shares videos via Web Share API or clipboard fallback.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, storing/retrieving them from sessionStorage, and cleaning them from the hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, container settings, fonts, animations, and plugin integrations.",
  "project_state.json": "Defines the project’s current state, including issues, existing features, and metadata for build planning."
}