{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Show preloader on every fresh app load (not on SPA route changes)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Show the existing preloader on each fresh app open/load while ensuring SPA route navigation never re-triggers it.",
      "acceptanceCriteria": [
        "When the app is opened in a new browser tab/window (or after fully closing and reopening the app), the preloader is shown before the main UI renders.",
        "Navigating between routes (e.g., Home → Trending → Profile) does not re-trigger the preloader.",
        "Refreshing/reloading the page triggers the preloader again (because this is a new app open/load)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update app-level gating so FirstLaunchPreloader is shown on initial React app mount every time the app loads (including refresh), and is never tied to route transitions (keep gating only at App root, not per-page)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Keep the preloader animation timing and visuals exactly as currently implemented in FirstLaunchPreloader.",
      "acceptanceCriteria": [
        "No changes to the step timings (1s, 2s, 3s, 4s, hold until 5.5s, then 0.5s fade-out callback) are introduced.",
        "The preloader continues to use /assets/generated/zizo-preloader-logo.dim_512x512.png and renders with the existing CSS-driven clip-path reveal."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure App continues to render the existing FirstLaunchPreloader component as-is (no prop/behavior changes that would affect its timing/visuals), only changing when it is shown (on app mount) and when the main UI becomes visible (after onComplete)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Remove the persistent first-launch localStorage gate so it no longer prevents the preloader from appearing on subsequent app opens.",
      "acceptanceCriteria": [
        "After the change, previously-set localStorage value 'app-first-launch-complete' does not stop the preloader from appearing on a new app open/load.",
        "The preloader completion still transitions cleanly to the main app UI without a flash of unstyled content."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove/replace the current localStorage-based FIRST_LAUNCH_KEY check and write (key: 'app-first-launch-complete') so the preloader is not persisted as 'complete' across app opens; keep a purely in-memory completion flag so the preloader runs once per full page load and then cleanly hands off to the main UI."
        }
      ]
    }
  ]
}